papers/JFNK_quasi_monolithic_FSI/fluidSolidInteraction/blobInTreacle/base/partitioned/0/fluid/pointMotionU
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointMotionU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    cylinder
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    right
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    left
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    up
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    down
    {
        type            symmetryPlane;
    }

    frontAndBack
    {
        type            empty;
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
