papers/JFNK_quasi_monolithic_FSI/fluidSolidInteraction/blobInTreacle/base/partitioned/0/solid/DFutureTime
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      DFutureTime;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    fixed
    {
       type            fixedValue;
       value           uniform (0 0 0);
    }

    interface
    {
        type            calculated;
        value           uniform (0 0 0);
    }

    frontAndBack
    {
        type           empty;
    }
}

// ************************************************************************* //
